zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_ltdc.h
/** @defgroup LTDC_BACK_COLOR LTDC BACK COLOR
  * @{
  */
#define LTDC_COLOR                        0x000000FFU   /*!< Color mask */
/**
  * @}
  */

/** @defgroup LTDC_BlendingFactor1 LTDC Blending Factor1
  * @{
  */
#define LTDC_BLENDING_FACTOR1_CA          0x00000400U   /*!< Blending factor : Cte Alpha */
#define LTDC_BLENDING_FACTOR1_PAxCA       0x00000600U   /*!< Blending factor : Cte Alpha x Pixel Alpha*/
/**
  * @}
  */

/** @defgroup LTDC_BlendingFactor2 LTDC Blending Factor2
  * @{
  */
#define LTDC_BLENDING_FACTOR2_CA          0x00000005U   /*!< Blending factor : Cte Alpha */
#define LTDC_BLENDING_FACTOR2_PAxCA       0x00000007U   /*!< Blending factor : Cte Alpha x Pixel Alpha*/
/**
  * @}
  */

/** @defgroup LTDC_Pixelformat LTDC Pixel format
  * @{
  */
#define LTDC_PIXEL_FORMAT_ARGB8888        0x00000000U   /*!< ARGB8888 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_ABGR8888        0x00000001U   /*!< ABGR8888 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_RGBA8888        0x00000002U   /*!< RGBA8888 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_BGRA8888        0x00000003U   /*!< BGRA8888 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_RGB565          0x00000004U   /*!< RGB565 LTDC pixel format               */
#define LTDC_PIXEL_FORMAT_BGR565          0x00000005U   /*!< RGB565 LTDC pixel format               */
#define LTDC_PIXEL_FORMAT_RGB888          0x00000006U   /*!< RGB888 LTDC pixel format               */
#define LTDC_PIXEL_FORMAT_ARGB1555        0x00000007U   /*!< ARGB1555 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_ARGB4444        0x00000008U   /*!< ARGB4444 LTDC pixel format             */
#define LTDC_PIXEL_FORMAT_L8              0x00000009U   /*!< L8 LTDC pixel format                   */
#define LTDC_PIXEL_FORMAT_AL44            0x0000000AU   /*!< AL44 LTDC pixel format                 */
#define LTDC_PIXEL_FORMAT_AL88            0x0000000BU   /*!< AL88 LTDC pixel format                 */
#define LTDC_PIXEL_FORMAT_UYVY            0x0000000CU   /*!< UYVY Interleave LTDC pixel format      */
#define LTDC_PIXEL_FORMAT_VYUY            0x0000000DU   /*!< VYUY Interleave LTDC pixel format      */
#define LTDC_PIXEL_FORMAT_YUYV            0x0000000EU   /*!< YUYV Interleave LTDC pixel format      */
#define LTDC_PIXEL_FORMAT_YVYU            0x0000000FU   /*!< YVYU Interleave LTDC pixel format      */
#define LTDC_PIXEL_FORMAT_NV12            0x00000010U   /*!< NV12 Semi Planar LTDC pixel format     */
#define LTDC_PIXEL_FORMAT_NV21            0x00000011U   /*!< NV21 Semi Planar LTDC pixel format     */
#define LTDC_PIXEL_FORMAT_YUV420          0x00000012U   /*!< YUV420 Full Planar LTDC pixel format   */
#define LTDC_PIXEL_FORMAT_YVU420          0x00000013U   /*!< YVU420 Full Planar LTDC pixel format   */
/**
  * @}
  */

/** @defgroup LTDC_Alpha LTDC Alpha
  * @{
  */
#define LTDC_ALPHA                        LTDC_LxCACR_CONSTA        /*!< LTDC Constant Alpha mask */
/**
  * @}
  */

/** @defgroup LTDC_LAYER_Config LTDC LAYER Config
  * @{
  */
#define LTDC_STOPPOSITION                 (LTDC_LxWHPCR_WHSPPOS >> 16U) /*!< LTDC Layer stop position  */
#define LTDC_STARTPOSITION                LTDC_LxWHPCR_WHSTPOS          /*!< LTDC Layer start position */

#define LTDC_COLOR_FRAME_BUFFER           LTDC_LxCFBLR_CFBLL            /*!< LTDC Layer Line length    */
#define LTDC_LINE_NUMBER                  LTDC_LxCFBLNR_CFBLNBR         /*!< LTDC Layer Line number    */
/**
  * @}
  */

/** @defgroup LTDC_Interrupts LTDC Interrupts
  * @{
  */
#define LTDC_IT_LI                        LTDC_IER_LIE              /*!< LTDC Line Interrupt            */
#define LTDC_IT_FU                        LTDC_IER_FUWIE            /*!< LTDC FIFO Underrun Interrupt   */
#define LTDC_IT_TE                        LTDC_IER_TERRIE           /*!< LTDC Transfer Error Interrupt  */
#define LTDC_IT_RR                        LTDC_IER_RRIE             /*!< LTDC Register Reload Interrupt */
#define LTDC_IT_UK                        LTDC_IER_FUKIE            /*!< LTDC FIFO Underrun Killing Interrupt */
#define LTDC_IT_CR                        LTDC_IER_CRCIE            /*!< LTDC CRC error Interrupt */
#define LTDC_IT_UR                        LTDC_IER_FURIE            /*!< LTDC FIFIO Underrun at rotation Interrupt */
/**
  * @}
  */

/** @defgroup LTDC_Flags LTDC Flags
  * @{
  */
#define LTDC_FLAG_LI                      LTDC_ISR_LIF              /*!< LTDC Line Interrupt Flag            */
#define LTDC_FLAG_FU                      LTDC_ISR_FUWIF            /*!< LTDC FIFO Underrun interrupt Flag   */
#define LTDC_FLAG_TE                      LTDC_ISR_TERRIF           /*!< LTDC Transfer Error interrupt Flag  */
#define LTDC_FLAG_RR                      LTDC_ISR_RRIF             /*!< LTDC Register Reload interrupt Flag */
#define LTDC_FLAG_UK                      LTDC_ISR_FUKIF            /*!< LTDC FIFO Underrun Killing Interrupt */
#define LTDC_FLAG_CR                      LTDC_ISR_CRCIF            /*!< LTDC CRC error Interrupt */
#define LTDC_FLAG_UR                      LTDC_ISR_FURIF            /*!< LTDC FIFIO Underrun at rotation Interrupt */
/**
  * @}
  */

/** @defgroup LTDC_Reload_Type LTDC Reload Type
  * @{
  */
#define LTDC_RELOAD_IMMEDIATE             LTDC_SRCR_IMR             /*!< Immediate Reload */
#define LTDC_RELOAD_VERTICAL_BLANKING     LTDC_SRCR_VBR             /*!< Vertical Blanking Reload */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup LTDC_Exported_Macros LTDC Exported Macros
  * @{
  */

/** @brief Reset LTDC handle state.
  * @param  __HANDLE__  LTDC handle
  * @retval None
  */
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
#define __HAL_LTDC_RESET_HANDLE_STATE(__HANDLE__) do{                                                  \
                                                      (__HANDLE__)->State = HAL_LTDC_STATE_RESET;     \
                                                      (__HANDLE__)->MspInitCallback = NULL;           \
                                                      (__HANDLE__)->MspDeInitCallback = NULL;         \
                                                    } while(0)
#else
#define __HAL_LTDC_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_LTDC_STATE_RESET)
#endif /*USE_HAL_LTDC_REGISTER_CALLBACKS */

/**
  * @brief  Enable the LTDC.
  * @param  __HANDLE__  LTDC handle
  * @retval None.
  */
#define __HAL_LTDC_ENABLE(__HANDLE__)    ((__HANDLE__)->Instance->GCR |= LTDC_GCR_LTDCEN)

/**
  * @brief  Disable the LTDC.
  * @param  __HANDLE__  LTDC handle
  * @retval None.
  */
#define __HAL_LTDC_DISABLE(__HANDLE__)   ((__HANDLE__)->Instance->GCR &= ~(LTDC_GCR_LTDCEN))

/**
  * @brief  Enable the LTDC Layer.
  * @param  __HANDLE__  LTDC handle
  * @param  __LAYER__   Specify the layer to be enabled.
  *                     This parameter can be LTDC_LAYER_1 (0) or LTDC_LAYER_2 (1) or LTDC_LAYER_3 (2).
  * @retval None.
  */
#define __HAL_LTDC_LAYER_ENABLE(__HANDLE__, __LAYER__)  ((LTDC_LAYER((__HANDLE__), (__LAYER__)))->CR \
                                                         |= (uint32_t)LTDC_LxCR_LEN)

/**
  * @brief  Disable the LTDC Layer.
  * @param  __HANDLE__  LTDC handle
  * @param  __LAYER__   Specify the layer to be disabled.
  *                     This parameter can be LTDC_LAYER_1 (0) or LTDC_LAYER_2 (1) or LTDC_LAYER_3 (2).
  * @retval None.
  */
#define __HAL_LTDC_LAYER_DISABLE(__HANDLE__, __LAYER__) ((LTDC_LAYER((__HANDLE__), (__LAYER__)))->CR \
                                                         &= ~(uint32_t)LTDC_LxCR_LEN)

/**
  * @brief  Reload immediately all LTDC Layers.
  * @param  __HANDLE__  LTDC handle
  * @retval None.
  */
#define __HAL_LTDC_RELOAD_IMMEDIATE_CONFIG(__HANDLE__)  ((__HANDLE__)->Instance->SRCR |= LTDC_SRCR_IMR)

/**
  * @brief  Reload during vertical blanking period all LTDC Layers.
  * @param  __HANDLE__  LTDC handle
  * @retval None.
  */
#define __HAL_LTDC_VERTICAL_BLANKING_RELOAD_CONFIG(__HANDLE__)  ((__HANDLE__)->Instance->SRCR |= LTDC_SRCR_VBR)

/* Interrupt & Flag management */
/**
  * @brief  Get the LTDC pending flags.
  * @param  __HANDLE__  LTDC handle
  * @param  __FLAG__    Get the specified flag.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_FLAG_LI: Line Interrupt flag
  *            @arg LTDC_FLAG_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_FLAG_TE: Transfer Error interrupt flag
  *            @arg LTDC_FLAG_RR: Register Reload Interrupt Flag
  *            @arg LTDC_FLAG_UK: LTDC FIFO Underrun Killing Interrupt flag
  *            @arg LTDC_FLAG_CR: LTDC CRC error Interrupt flag
  *            @arg LTDC_FLAG_UR: LTDC FIFIO Underrun at rotation Interrupt flag
  * @retval The state of FLAG (SET or RESET).
  */
#define __HAL_LTDC_GET_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ISR & (__FLAG__))

/**
  * @brief  Clears the LTDC pending flags.
  * @param  __HANDLE__  LTDC handle
  * @param  __FLAG__    Specify the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_FLAG_LI: Line Interrupt flag
  *            @arg LTDC_FLAG_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_FLAG_TE: Transfer Error interrupt flag
  *            @arg LTDC_FLAG_RR: Register Reload Interrupt Flag
  *            @arg LTDC_FLAG_UK: LTDC FIFO Underrun Killing Interrupt flag
  *            @arg LTDC_FLAG_CR: LTDC CRC error Interrupt flag
  *            @arg LTDC_FLAG_UR: LTDC FIFIO Underrun at rotation Interrupt flag
  * @retval None
  */
#define __HAL_LTDC_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ICR = (__FLAG__))

/**
  * @brief  Enables the specified LTDC interrupts.
  * @param  __HANDLE__  LTDC handle
  * @param __INTERRUPT__ Specify the LTDC interrupt sources to be enabled.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_IT_LI: Line Interrupt flag
  *            @arg LTDC_IT_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_IT_TE: Transfer Error interrupt flag
  *            @arg LTDC_IT_RR: Register Reload Interrupt Flag
  *            @arg LTDC_IT_UK: LTDC FIFO Underrun Killing Interrupt flag
  *            @arg LTDC_IT_CR: LTDC CRC error Interrupt flag
  *            @arg LTDC_IT_UR: LTDC FIFIO Underrun at rotation Interrupt flag
  * @retval None
  */
#define __HAL_LTDC_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER |= (__INTERRUPT__))

/**
  * @brief  Disables the specified LTDC interrupts.
  * @param  __HANDLE__  LTDC handle
  * @param __INTERRUPT__ Specify the LTDC interrupt sources to be disabled.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_IT_LI: Line Interrupt flag
  *            @arg LTDC_IT_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_IT_TE: Transfer Error interrupt flag
  *            @arg LTDC_IT_RR: Register Reload Interrupt Flag
  *            @arg LTDC_IT_UK: LTDC FIFO Underrun Killing Interrupt flag
  *            @arg LTDC_IT_CR: LTDC CRC error Interrupt flag
  *            @arg LTDC_IT_UR: LTDC FIFIO Underrun at rotation Interrupt flag
  * @retval None
  */
#define __HAL_LTDC_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER &= ~(__INTERRUPT__))

/**
  * @brief  Check whether the specified LTDC interrupt has occurred or not.
  * @param  __HANDLE__  LTDC handle
  * @param __INTERRUPT__ Specify the LTDC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg LTDC_IT_LI: Line Interrupt flag
  *            @arg LTDC_IT_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_IT_TE: Transfer Error interrupt flag
  *            @arg LTDC_IT_RR: Register Reload Interrupt Flag
  * @retval The state of INTERRUPT (SET or RESET).
  */
#define __HAL_LTDC_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER & (__INTERRUPT__))

/**
  * @brief  Get the Secure LTDC pending flags.
  * @param  __HANDLE__  LTDC handle
  * @param  __FLAG__    Get the specified flag.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_FLAG_LI: Line Interrupt flag
  *            @arg LTDC_FLAG_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_FLAG_TE: Transfer Error interrupt flag
  *            @arg LTDC_FLAG_RR: Register Reload Interrupt Flag
  *            @arg LTDC_FLAG_UK: LTDC FIFO Underrun Killing Interrupt flag
  *            @arg LTDC_FLAG_CR: LTDC CRC error Interrupt flag
  *            @arg LTDC_FLAG_UR: LTDC FIFIO Underrun at rotation Interrupt flag
  * @retval The state of FLAG (SET or RESET).
  */
#define __HAL_LTDC_GET_SECURE_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ISR2 & (__FLAG__))

/**
  * @brief  Clears the LTDC Secure pending flags.
  * @param  __HANDLE__  LTDC handle
  * @param  __FLAG__    Specify the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_FLAG_LI: Line Interrupt flag
  *            @arg LTDC_FLAG_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_FLAG_TE: Transfer Error interrupt flag
  *            @arg LTDC_FLAG_RR: Register Reload Interrupt Flag
  *            @arg LTDC_FLAG_UK: LTDC FIFO Underrun Killing Interrupt flag
  *            @arg LTDC_FLAG_CR: LTDC CRC error Interrupt flag
  *            @arg LTDC_FLAG_UR: LTDC FIFIO Underrun at rotation Interrupt flag
  * @retval None
  */
#define __HAL_LTDC_CLEAR_SECURE_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->Instance->ICR2 = (__FLAG__))

/**
  * @brief  Enables the specified LTDC Secure interrupts.
  * @param  __HANDLE__  LTDC handle
  * @param __INTERRUPT__ Specify the LTDC interrupt sources to be enabled.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_IT_LI: Line Interrupt flag
  *            @arg LTDC_IT_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_IT_TE: Transfer Error interrupt flag
  *            @arg LTDC_IT_RR: Register Reload Interrupt Flag
  *            @arg LTDC_IT_UK: LTDC FIFO Underrun Killing Interrupt flag
  *            @arg LTDC_IT_CR: LTDC CRC error Interrupt flag
  *            @arg LTDC_IT_UR: LTDC FIFIO Underrun at rotation Interrupt flag
  * @retval None
  */
#define __HAL_LTDC_ENABLE_SECURE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER2 |= (__INTERRUPT__))

/**
  * @brief  Disables the specified LTDC Secure interrupts.
  * @param  __HANDLE__  LTDC handle
  * @param __INTERRUPT__ Specify the LTDC interrupt sources to be disabled.
  *          This parameter can be any combination of the following values:
  *            @arg LTDC_IT_LI: Line Interrupt flag
  *            @arg LTDC_IT_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_IT_TE: Transfer Error interrupt flag
  *            @arg LTDC_IT_RR: Register Reload Interrupt Flag
  *            @arg LTDC_IT_UK: LTDC FIFO Underrun Killing Interrupt flag
  *            @arg LTDC_IT_CR: LTDC CRC error Interrupt flag
  *            @arg LTDC_IT_UR: LTDC FIFIO Underrun at rotation Interrupt flag
  * @retval None
  */
#define __HAL_LTDC_DISABLE_SECURE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER2 &= ~(__INTERRUPT__))

/**
  * @brief  Check whether the specified LTDC Secure interrupt has occurred or not.
  * @param  __HANDLE__  LTDC handle
  * @param __INTERRUPT__ Specify the LTDC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg LTDC_IT_LI: Line Interrupt flag
  *            @arg LTDC_IT_FU: FIFO Underrun Interrupt flag
  *            @arg LTDC_IT_TE: Transfer Error interrupt flag
  *            @arg LTDC_IT_RR: Register Reload Interrupt Flag
  *            @arg LTDC_IT_UK: LTDC FIFO Underrun Killing Interrupt flag
  *            @arg LTDC_IT_CR: LTDC CRC error Interrupt flag
  *            @arg LTDC_IT_UR: LTDC FIFIO Underrun at rotation Interrupt flag
  * @retval The state of INTERRUPT (SET or RESET).
  */
#define __HAL_LTDC_GET_SECURE_IT_SOURCE(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->Instance->IER2 & (__INTERRUPT__))
/**
  * @}
  */

/* Include LTDC HAL Extension module */
#include "stm32mp2xx_hal_ltdc_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup LTDC_Exported_Functions
  * @{
  */
/** @addtogroup LTDC_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions *****************************/
HAL_StatusTypeDef HAL_LTDC_Init(LTDC_HandleTypeDef *hltdc);
HAL_StatusTypeDef HAL_LTDC_DeInit(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_MspInit(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_MspDeInit(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_ErrorCallback(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_LineEventCallback(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_ReloadEventCallback(LTDC_HandleTypeDef *hltdc);
HAL_StatusTypeDef HAL_LTDC_ProgramSecureLineEvent(LTDC_HandleTypeDef *hltdc, uint32_t Line);
void HAL_LTDC_Secure_ErrorCallback(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_Secure_LineEventCallback(LTDC_HandleTypeDef *hltdc);
void HAL_LTDC_Secure_ReloadEventCallback(LTDC_HandleTypeDef *hltdc);

/* Mirroring functions *****************************/
HAL_StatusTypeDef HAL_LTDC_EnableHMirror(LTDC_HandleTypeDef *hltdc, const LTDC_LayerCfgTypeDef *pLayerCfg,
                                         uint32_t LayerIdx);
HAL_StatusTypeDef HAL_LTDC_DisableHMirror(LTDC_HandleTypeDef *hltdc,
                                          const LTDC_LayerCfgTypeDef *pLayerCfg, uint32_t LayerIdx);
HAL_StatusTypeDef HAL_LTDC_EnableVMirror(LTDC_HandleTypeDef *hltdc, const LTDC_LayerCfgTypeDef *pLayerCfg,
                                         uint32_t LayerIdx);
HAL_StatusTypeDef HAL_LTDC_DisableVMirror(LTDC_HandleTypeDef *hltdc, const LTDC_LayerCfgTypeDef *pLayerCfg,
                                          uint32_t LayerIdx);

/* Single frame mode software trigger functions *****************************/
HAL_StatusTypeDef HAL_LTDC_EnableSFSWTrigger(LTDC_HandleTypeDef *hltdc);
HAL_StatusTypeDef HAL_LTDC_DisableSFSWTrigger(LTDC_HandleTypeDef *hltdc);

/* Callbacks Register/UnRegister functions  ***********************************/
#if (USE_HAL_LTDC_REGISTER_CALLBACKS == 1)
HAL_StatusTypeDef HAL_LTDC_RegisterCallback(LTDC_HandleTypeDef *hltdc, HAL_LTDC_CallbackIDTypeDef CallbackID,
                                            pLTDC_CallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_LTDC_UnRegisterCallback(LTDC_HandleTypeDef *hltdc, HAL_LTDC_CallbackIDTypeDef CallbackID);
#endif /* USE_HAL_LTDC_REGISTER_CALLBACKS */

/**
  * @}
  */

